# DataFrame
- 2차원 배열
- 행과 열로 구성

In [1]:
# Dictionary를 이용한 DataFrame 생성
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [3]:
import pandas as pd

df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [5]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서','예은'],
    columns=['나이', '성별', '학교']
    )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [7]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [8]:
# 행 인덱스, 열 이름 변경하기 #1
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [9]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서','예은'],
    columns=['나이', '성별', '학교']
    )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [13]:
# 행 index, 열 이름 변경하기 #2
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True) # inplace = True : 변수에 바로 적용하겠다
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [15]:
# 행이름 변경하기
# df의 행 index 중에서, '준서'를 '학생1'로 '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [21]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [
        [90, 98, 85, 100],
        [80, 89, 95, 90],
        [70, 95, 100, 90],
    ],
    index=['서준', '우현', '인아'],
    columns=['수학', '영어', '음악', '체육']
    )
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [20]:
# dictionary를 이용한 DataFrame 생성
df = pd.DataFrame(
    {'수학':[90,80,70], '영어':[98, 89, 95], '음악':[85,95,100], '체육':[100,90,90]},
    index=['서준', '우현', '인아']
    )
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행 삭제

In [23]:
df2 = df.copy() # 별개의 사본을 만든다(그냥 입력하면 수정도 함께)
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [24]:
# df2의 index가 우현인 행을 삭제
df2.drop('우현', axis=0) # inplace 없으면 df2 원형은 그대로다, axis=0이 기본값(행방향)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [35]:
df3 = df.copy()
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [36]:
# df3의 index가 우현과 인아인 2개 행을 삭제
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [37]:
# df4의 coulum이 수학인 열 삭제 
df4 = df.copy()
df4.drop('수학', axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [42]:
df5 = df.copy()

In [39]:
# df5의 영어와 음악 2개 열 삭제
df5.drop(['영어', '음악'], axis=1, inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [44]:
# df5의 영어와 음악 2개 열 삭제
df5 = df.copy()
df5.drop(['영어', '음악'], axis='columns', inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90